In [3]:
import pandas as pd
import numpy as np

In [6]:
ad=pd.read_csv("../test/ad.csv")
click_log=pd.read_csv("../test/click_log.csv")

In [8]:
click_log["user_id"].nunique()

1000000

In [2]:
ad.describe()

NameError: name 'ad' is not defined

In [5]:
ad.head(10)

   creative_id  ad_id product_id  product_category  advertiser_id industry
0            1      1         \N                 5            381       78
1            3      3         \N                 5            598      165
2            4      4         \N                 5            108      202
3            5      5         \N                 5            109        6
4            6      6         \N                 5            400        6
5            7      7         \N                 5            148      297
6           10     10         \N                 5            100       73
7           13     13         \N                 5            113      267
8           14     14         \N                 5            556        2
9           16     16         \N                 5            623        1

In [6]:
click_log["user_id"].describe()

count    3.358551e+07
mean     3.499714e+06
std      2.883313e+05
min      3.000001e+06
25%      3.249486e+06
50%      3.500907e+06
75%      3.748320e+06
max      4.000000e+06
Name: user_id, dtype: float64

In [7]:
click_log.head(10)

   time  user_id  creative_id  click_times
0    20  3131989       645764            1
1    20  3131989      1027422            1
2    20  3131989      1106443            1
3    20  3131989       629802            1
4    59  3131989      2839769            1
5    16  3131989       564033            1
6    17  3131989       103304            1
7    11  3131989       577903            1
8    20  3131989       103304            1
9    16  3131989       103304            1

In [8]:
userid=pd.unique(click_log["user_id"])

In [9]:
userid

array([3131989, 3131990, 3131994, ..., 3131984, 3131987, 3131988],
      dtype=int64)

In [10]:
data=np.array([userid,np.random.randint(1,11,size=len(userid)),np.array([1]*len(userid))])
data=np.rot90(data)
data

array([[3131988,      10,       1],
       [3131987,       1,       1],
       [3131984,       6,       1],
       ...,
       [3131994,       5,       1],
       [3131990,       4,       1],
       [3131989,       3,       1]], dtype=int64)

In [11]:
submission=pd.DataFrame(data,columns=["user_id","predicted_age","predicted_gender"])
submission

        user_id  predicted_age  predicted_gender
0       3131988             10                 1
1       3131987              1                 1
2       3131984              6                 1
3       3131983              6                 1
4       3131979              7                 1
...         ...            ...               ...
999995  3132000              8                 1
999996  3131995              5                 1
999997  3131994              5                 1
999998  3131990              4                 1
999999  3131989              3                 1

[1000000 rows x 3 columns]

In [12]:
submission.to_csv("./submission.csv",index=False)